# Traiter les valeurs manquantes
## Trouver les valeurs manquantes
- Lire le dataset titanic_survival.csv
- Comparer le nombre de valeurs dans la colonne "age" possédant des valeurs manquantes
    - Assigner à la variable age la colonne des ages du dataframe titanic_survival
    - Utiliser pandas.isnull() sur la variable age pour créer une series de valeurs True et False
    - Ustiliser la series résultante pour sélectionner seulement les éléments de la colonne "age" qui sonts nuls et assigner le résultat à la variable age_null
    - Assigner le nombre de valeurs manquantes de age_null à la variable age_null_count (fonction len())
- Affihce rage_null_count pour voir le nombre de valeurs manquantes de la colonne "age"

In [2]:
import pandas as pd 

titanic_survival = pd.read_csv("jeux_de_donnees/titanic_survival.csv")
titanic_survival

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1.0,1.0,"Allen, Miss. Elisabeth Walton",female,29.0000,0.0,0.0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1.0,1.0,"Allison, Master. Hudson Trevor",male,0.9167,1.0,2.0,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1.0,0.0,"Allison, Miss. Helen Loraine",female,2.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1.0,0.0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1.0,0.0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1.0,2.0,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1305,3.0,0.0,"Zabour, Miss. Thamine",female,NaN,1.0,0.0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3.0,0.0,"Zakarian, Mr. Mapriededer",male,26.5000,0.0,0.0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3.0,0.0,"Zakarian, Mr. Ortin",male,27.0000,0.0,0.0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3.0,0.0,"Zimmerman, Mr. Leo",male,29.0000,0.0,0.0,315082,7.8750,NaN,S,NaN,NaN,NaN
1309,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [3]:
age = titanic_survival["age"]
age_null = age[age.isnull()==True]
age_null_count = len(age_null)
print(age_null_count)

264

## Problème avec les valeurs manquantes
- Utiliser age_is_null pour créer un vecteur qui contient seulement les valeurs de la colonne "age" qui ne sont pas NaN
- Assigner ce résultta à la variable good_ages
- Calculer la moyenne de ce nouveau vecteur et sassigner le résultat à la variable mean_age
- Afficher cette moyenne

In [4]:
age_is_null = pd.isnull(titanic_survival["age"])
good_ages = titanic_survival["age"][age_is_null==False]

mean_age = good_ages.mean()

print(mean_age)

29.8811345124283

## Calculer la moyenne
- Assigner la moyenne de la colonne "fare" à la variable mean_fare

In [5]:
mean_fare = titanic_survival["fare"].mean()
print(mean_fare)

33.29547928134572

## Calculer des statistiques de prix
- Créer un dictionnaire vide qu'on nommera fares_by_class
- Créer la liste passenger_classes qui contient les éléments [1,2,3]
- Utiliser une boucle for pour parcourir la liste passenger_classes
    - Sélectionner juste les lignes de titanic_survival pour lesquelles la colone pclass est égale à la variable de temporaire de la boucle
    - Sélectionner seulement la colonne fare pour ce sous-sensemble de lignes (correspondant à la classe)
    - Ajouter cette moyenne calculée de la classe au disctionnaire fares_by_class avec comme clé le numéro de la classe et comme valeur la moyenne du prix du billet
- Une fois al boucle achevée, afficher le resultat

In [6]:
fares_by_class = {}
passengers_classes=[1.,2.,3.]

for i in passengers_classes:

    rows_class = titanic_survival[titanic_survival["pclass"]==i]
    fares_by_class[i] = rows_class["fare"].mean()
    
print(fares_by_class)

# Autres solution :

print({pclass: titanic_survival["fare"][titanic_survival["pclass"] == pclass].mean() for pclass in titanic_survival["pclass"].unique()})

titanic_survival[["fare", "pclass"]].groupby("pclass").mean()

{1.0: 87.50899164086687, 2.0: 21.1791963898917, 3.0: 13.302888700564957}
{1.0: 87.50899164086687, 2.0: 21.1791963898917, 3.0: 13.302888700564957, nan: nan}

             fare
pclass
1.0     87.508992
2.0     21.179196
3.0     13.302889